STMicroelectronics/STM32CubeH5/Projects/STM32H5F5J-DK/Templates_LL/TrustZoneDisabled/Inc/main.h
/**
  ******************************************************************************
  * @file    Templates_LL/TrustZoneDisabled/Inc/main.h
  * @author  MCD Application Team
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MAIN_H
#define MAIN_H

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_ll_adc.h"
#include "stm32h5xx_ll_bus.h"
#include "stm32h5xx_ll_comp.h"
#include "stm32h5xx_ll_cordic.h"
#include "stm32h5xx_ll_cortex.h"
#include "stm32h5xx_ll_crc.h"
#include "stm32h5xx_ll_crs.h"
#include "stm32h5xx_ll_dac.h"
#include "stm32h5xx_ll_dcache.h"
#include "stm32h5xx_ll_dma.h"
#include "stm32h5xx_ll_dma2d.h"
#include "stm32h5xx_ll_exti.h"
#include "stm32h5xx_ll_fmac.h"
#include "stm32h5xx_ll_gpio.h"
#include "stm32h5xx_ll_i2c.h"
#include "stm32h5xx_ll_i3c.h"
#include "stm32h5xx_ll_icache.h"
#include "stm32h5xx_ll_iwdg.h"
#include "stm32h5xx_ll_lptim.h"
#include "stm32h5xx_ll_lpuart.h"
#include "stm32h5xx_ll_opamp.h"
#include "stm32h5xx_ll_pka.h"
#include "stm32h5xx_ll_play.h"
#include "stm32h5xx_ll_pwr.h"
#include "stm32h5xx_ll_rcc.h"
#include "stm32h5xx_ll_rng.h"
#include "stm32h5xx_ll_rtc.h"
#include "stm32h5xx_ll_spi.h"
#include "stm32h5xx_ll_system.h"
#include "stm32h5xx_ll_tim.h"
#include "stm32h5xx_ll_ucpd.h"
#include "stm32h5xx_ll_usart.h"
#include "stm32h5xx_ll_utils.h"
#include "stm32h5xx_ll_wwdg.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

#endif /* MAIN_H */
